In [3]:
import pandas as pd

list = [[1,2,3],[4,5,6]]
pd_s1 = pd.DataFrame(list)
print(pd_s1)

   0  1  2
0  1  2  3
1  4  5  6

In [15]:
list1 = [1,2,3,4,5]
pd_s2 = pd.DataFrame(list1)
pd_s2

   0
0  1
1  2
2  3
3  4
4  5

In [17]:
pd_s2['1열'] = [7,8,9,10,11]
pd_s2

   0  1열
0  1   7
1  2   8
2  3   9
3  4  10
4  5  11

In [19]:
pd_s2.columns

Index([0, '1열'], dtype='object')

In [21]:
pd_s3 = pd_s2.rename(columns={0:'0열'})
pd_s3

   0열  1열
0   1   7
1   2   8
2   3   9
3   4  10
4   5  11

In [23]:
#이차원배열
score = [
    ['정약용',70,80,100],
    ['이순신',100,80,70],
    ['이율곡',80,70,70]
]
print(type(score))

<class 'list'>

In [31]:
score_df=pd.DataFrame(score)
print(type(score_df))
score_df

<class 'pandas.core.frame.DataFrame'>

     0    1   2    3
0  정약용   70  80  100
1  이순신  100  80   70
2  이율곡   80  70   70

In [33]:
score_df.columns=["이름","국어","영어","수학"]
score_df

    이름   국어  영어   수학
0  정약용   70  80  100
1  이순신  100  80   70
2  이율곡   80  70   70

In [35]:
score_df.shape

(3, 4)

In [37]:
score_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      3 non-null      object
 1   국어      3 non-null      int64
 2   영어      3 non-null      int64
 3   수학      3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 228.0+ bytes

In [61]:
pd_s4 = {
    'col_str1':['1','2','3'],
    'col_str2':['4','5','6'],
    'col_str3':[4,10.,'7']
}
pd_df = pd.DataFrame(pd_s4)
pd_df

  col_str1 col_str2 col_str3
0        1        4        4
1        2        5     10.0
2        3        6        7

In [63]:
pd_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   col_str1  3 non-null      object
 1   col_str2  3 non-null      object
 2   col_str3  3 non-null      object
dtypes: object(3)
memory usage: 204.0+ bytes

In [71]:
pd_astype = pd_df.astype({'col_str2':int,'col_str3':float})
pd_astype
# pd_astype.info()

  col_str1  col_str2  col_str3
0        1         4       4.0
1        2         5      10.0
2        3         6       7.0

In [95]:
pd_astype
# pd_astype.drop(['col_str1'],axis=1,inplace=True)
test = pd_astype.drop(['col_str2'],axis=1)
test
print(test)
print(pd_astype)

   col_str3
0       4.0
1      10.0
2       7.0
   col_str2  col_str3
0         4       4.0
1         5      10.0
2         6       7.0

In [97]:
x = [0,1,2,3,4]
y = [0,3,4,5,2]
test_df = pd.DataFrame()
test_df['x_value'] = x
test_df['y_value'] = y
test_df

   x_value  y_value
0        0        0
1        1        3
2        2        4
3        3        5
4        4        2

In [99]:
test_df.shape

(5, 2)

In [111]:
test_df['xy_value1'] = test_df['x_value'] * test_df['y_value']
test_df

   x_value  y_value  xy_value  xy_value1
0        0        0         0          0
1        1        3         4          3
2        2        4         6          8
3        3        5         8         15
4        4        2         6          8